---
kind: property
id: P:Autodesk.Revit.DB.OpenOptions.OpenForeignOption
source: html/dbc3eceb-cd55-3263-47fc-4812cdf06280.htm
---
# Autodesk.Revit.DB.OpenOptions.OpenForeignOption Property

An option that specifies how to open files saved by an application that was not developed or licensed by Autodesk.

## Syntax (C#)
```csharp
public OpenForeignOption OpenForeignOption { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration